---
type: SphericalLightDistribution
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 2
tags: [revit-api, class]
---

# SphericalLightDistribution

`Autodesk.Revit.DB.Lighting.SphericalLightDistribution` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SphericalLightDistribution | — | `` |
| Constructor | SphericalLightDistribution | 2013 | `public SphericalLightDistribution ()` |